/**  
 * 多个工作线程通过队列获取主线程分配给它们的作业
 * apue P330
 * rwlock实现
 *
 * 图见P309
 *                                .---.                                               
 *   .---.                       /     \ 
 *  /     \                     ; main  :                                             
 * ;worker :                    :thread ;                                             
 * :thread1;^                    \     /                                              
 *  \     /  \                    \   /                                               
 *   \   /    \                    `-'                                                
 *    `-'      \                    /                                                 
 *              \          /-------/                                                  
 *               X--------v                                                           
 *  .---.        |        |                                                           
 * /     \       |        |       +-------+      +-------+     +-------+     +-------+
 *; woker :      |        |       |       |      |       |     |       |     |       |
 *:thread2;<-----+ worker |       | TID1  |      | TID1  |     | TID3  |     | TID2  |
 * \     /       | queue  |<------|  job  |<-----|  job  <-----|  job  |<----|  job  |
 *  \   /        |        |       |       |      |       |     |       |     |       |
 *   `-'         |        |       +-------+      +-------+     +-------+     +-------+
 *               |        |                                                           
 *               X--------+                                                           
 *   .---.      /                                                                     
 *  /     \   //                                                                      
 * ;worker : /                                                                        
 * :thread3;v                                                                         
 *  \     /                                                                           
 *   \   /                                                                            
 *    `-'                                                                             
 */

#include <pthread.h>

int main(int argc, char *argv[])
{
    
    return 0;
}
